In [4]:
import numpy as np
import pandas as pd

In [9]:
#Create each data structure
my_list = [1,2,3]
my_list

[1, 2, 3]

In [10]:
labels = ['a','b','c']
labels

['a', 'b', 'c']

In [11]:
diction = {'a':1,'b':2,'c':3}
diction

{'a': 1, 'b': 2, 'c': 3}

In [12]:
arr = np.array(my_list)
arr

array([1, 2, 3])

In [13]:
pd.Series(data = my_list, index = labels)
#Series is built on top of numpy array where we can give index to the elements on our own.

a    1
b    2
c    3
dtype: int64

In [16]:
pd.Series(my_list,labels)

a    1
b    2
c    3
dtype: int64

In [17]:
pd.Series(arr,labels)

a    1
b    2
c    3
dtype: int32

In [18]:
pd.Series(diction)

a    1
b    2
c    3
dtype: int64

In [23]:
ser1 = pd.Series(data =  (np.array(np.arange(0,11)))**2 , index = np.array(np.arange(0,11)))

In [24]:
ser1

0       0
1       1
2       4
3       9
4      16
5      25
6      36
7      49
8      64
9      81
10    100
dtype: int32

In [25]:
ser1[9]

81

In [26]:
ser2 = pd.Series(data =  (np.array(np.arange(0,11)))**3 , index = np.array(np.arange(0,11)))
#Will create a series having the data which is equal to square of the index from 0 to 10

In [27]:
ser2

0        0
1        1
2        8
3       27
4       64
5      125
6      216
7      343
8      512
9      729
10    1000
dtype: int32

In [28]:
ser1 + ser2

0        0
1        2
2       12
3       36
4       80
5      150
6      252
7      392
8      576
9      810
10    1100
dtype: int32

Next we will work with Dataframes. Dataframes are nothing but just a bunch of Series put togheter in a datastructure called Dataframe.

In [29]:
np.random.seed(101)

In [32]:
x = np.random.randn(5,4)

In [34]:
df = pd.DataFrame(x,['A','B','C','D','E'],['W','X','Y','Z'])

In [35]:
df

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
B -0.134841  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D -0.497104 -0.754070 -0.943406  0.484752
E -0.116773  1.901755  0.238127  1.996652

In [36]:
df['W']

A    0.302665
B   -0.134841
C    0.807706
D   -0.497104
E   -0.116773
Name: W, dtype: float64

In [37]:
df.Y

A   -1.706086
B    0.166905
C    0.638787
D   -0.943406
E    0.238127
Name: Y, dtype: float64

In [38]:
df['New'] = df['W'] + df['Y']

In [39]:
df

          W         X         Y         Z       New
A  0.302665  1.693723 -1.706086 -1.159119 -1.403420
B -0.134841  0.390528  0.166905  0.184502  0.032064
C  0.807706  0.072960  0.638787  0.329646  1.446493
D -0.497104 -0.754070 -0.943406  0.484752 -1.440510
E -0.116773  1.901755  0.238127  1.996652  0.121354

In [45]:
df.drop("New",axis = 1,inplace = True)

In [46]:
df

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
B -0.134841  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D -0.497104 -0.754070 -0.943406  0.484752
E -0.116773  1.901755  0.238127  1.996652

In [47]:
df.shape

(5, 4)

In [48]:
df[['W','Z']]

          W         Z
A  0.302665 -1.159119
B -0.134841  0.184502
C  0.807706  0.329646
D -0.497104  0.484752
E -0.116773  1.996652

In [49]:
df

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
B -0.134841  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D -0.497104 -0.754070 -0.943406  0.484752
E -0.116773  1.901755  0.238127  1.996652

In [51]:
df.loc['A'] #To get rows, we need to use loc cammand.In this we can specify the indexNAME and not indexValue

W    0.302665
X    1.693723
Y   -1.706086
Z   -1.159119
Name: A, dtype: float64

In [53]:
#iloc gives the row when it is passed a indexVALUE
df.iloc[0]

W    0.302665
X    1.693723
Y   -1.706086
Z   -1.159119
Name: A, dtype: float64

In [55]:
df.loc[['A','B'],['W','Y']]

          W         Y
A  0.302665 -1.706086
B -0.134841  0.166905

In [58]:
df

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
B -0.134841  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D -0.497104 -0.754070 -0.943406  0.484752
E -0.116773  1.901755  0.238127  1.996652

In [60]:
df>0

       W      X      Y      Z
A   True   True  False  False
B  False   True   True   True
C   True   True   True   True
D  False  False  False   True
E  False   True   True   True

In [61]:
df[df>0]

          W         X         Y         Z
A  0.302665  1.693723       NaN       NaN
B       NaN  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D       NaN       NaN       NaN  0.484752
E       NaN  1.901755  0.238127  1.996652

In [65]:
df[df["Z"]>0]

          W         X         Y         Z
B -0.134841  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D -0.497104 -0.754070 -0.943406  0.484752
E -0.116773  1.901755  0.238127  1.996652

In [67]:
df[df["Z"]>0][['Y','Z']]

          Y         Z
B  0.166905  0.184502
C  0.638787  0.329646
D -0.943406  0.484752
E  0.238127  1.996652

In [70]:
df[(df["Z"]>0) & (df['W']<1) ]

          W         X         Y         Z
B -0.134841  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D -0.497104 -0.754070 -0.943406  0.484752
E -0.116773  1.901755  0.238127  1.996652

In [71]:
df

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
B -0.134841  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D -0.497104 -0.754070 -0.943406  0.484752
E -0.116773  1.901755  0.238127  1.996652

In [72]:
df.reset_index()

  index         W         X         Y         Z
0     A  0.302665  1.693723 -1.706086 -1.159119
1     B -0.134841  0.390528  0.166905  0.184502
2     C  0.807706  0.072960  0.638787  0.329646
3     D -0.497104 -0.754070 -0.943406  0.484752
4     E -0.116773  1.901755  0.238127  1.996652

In [73]:
df.set_index('Z')

                  W         X         Y
Z
-1.159119  0.302665  1.693723 -1.706086
 0.184502 -0.134841  0.390528  0.166905
 0.329646  0.807706  0.072960  0.638787
 0.484752 -0.497104 -0.754070 -0.943406
 1.996652 -0.116773  1.901755  0.238127

In [74]:
df

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
B -0.134841  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D -0.497104 -0.754070 -0.943406  0.484752
E -0.116773  1.901755  0.238127  1.996652

In [75]:
newInd = "CA NY NJ OR CO".split()

In [76]:
newInd

['CA', 'NY', 'NJ', 'OR', 'CO']

In [82]:
df["States"] = newInd

In [83]:
df

          W         X         Y         Z States
A  0.302665  1.693723 -1.706086 -1.159119     CA
B -0.134841  0.390528  0.166905  0.184502     NY
C  0.807706  0.072960  0.638787  0.329646     NJ
D -0.497104 -0.754070 -0.943406  0.484752     OR
E -0.116773  1.901755  0.238127  1.996652     CO

In [85]:
df.set_index('States')

               W         X         Y         Z
States
CA      0.302665  1.693723 -1.706086 -1.159119
NY     -0.134841  0.390528  0.166905  0.184502
NJ      0.807706  0.072960  0.638787  0.329646
OR     -0.497104 -0.754070 -0.943406  0.484752
CO     -0.116773  1.901755  0.238127  1.996652